import {Component} from '@angular/core';

@Component({
  selector: 'app-our-services',
  templateUrl: './our-services.component.html',
  styleUrls: ['./our-services.component.scss']
})
export class OurServicesComponent {
  readonly services = [
    {
      type: 'Отоларинголога',
      list: [
        'Консультація спеціаліста',
        'Відеоендоскопія',
        'Невідкладна допомога',
        'Профогляди',
        'Процедури (промивання лакун мигдаликів, промивання носа методом переміщення рідин, вимивання сірчаних корків)',
        'Видалення сторонніх тіл ЛОР органів',
        'Мала хірургічна допомога',
        'Аудіограма і тимпанометрія',
      ]
    },
    {
      type: 'Косметолога',
      list: [
        'Консультація та підбір доглядової косметики за типом шкіри',
        'Гігієнічна чистка обличчя ( ультразвукова, механічна, комбінована)',
        'Пілінги (поверхневі, серединні, механічні)',
        'Доглядові процедури',
        'Масаж обличчя (класичний, лімфо дренажний, іспанський)',
        'Апаратні процедури',
        'Ін’єкції краси (мезотерапія та біоревіталізація)',
        'Ботулінотерапія верхньої третини обличчя.',
      ]
    }
  ]
}
